<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Title</title>
    <style>

    </style>
</head>
<body>
<a style="color: black; font-family:sans-serif,impact;position: absolute;left: 0px;top: 380px;" href="/document">Document</a>
<h3>
    10. Інформаційна система спортивних організацій
    Спортивна інфраструктура міста представлена спортивними спорудженнями різного типу: спортивні зали, манежі, стадіони, корти й т.д. Кожна з категорій спортивних споруджень має атрибути, специфічні тільки для неї: стадіон характеризується місткістю, корт – типом покриття.
    Спортсмени під керівництвом тренерів займаються окремими видами спорту, при цьому той самий спортсмен може займатися декількома видами спорту, і в рамках того самого виду спорту може тренуватися в декількох тренерів. Всі спортсмени поєднуються в спортивні клуби, при цьому кожний з них може виступати тільки за один клуб.
    Організатори змагань проводять змагання по окремих видах спорту на спортивних спорудженнях міста. За результатами участі спортсменів у змаганнях відбувається нагородження.
    Види запитів в інформаційній системі:
    1)	Одержати перелік спортивних споруд вказаного типу загалом або тих, які задовольняють певні умови (місткість, вид спорту тощо).
    2)	Одержати список спортсменів, які займаються вказаним видом спорту (загалом та не нижче певного розряду).
    3)	Одержати список спортсменів, які тренуються у вказаного тренера (загалом та не нижче певного розряду).
    4)	Одержати список спортсменів, які займаються кількома видами спорту, вказавши всі види.
    5)	Одержати список тренерів вказаного спортсмена.
    6)	Одержати перелік змагань проведених протягом вказаного періоду загалом та вказаним організатором.
    7)	Одержати список призерів вказаного змагання.
    8)	Одержати перелік змагань, проведених у вказаній спортивній споруді загалом та із певного виду спорту.
    9)	Одержати перелік спортивних клубів та кількість спортсменів цих клубів, які брали участь у спортивних змаганнях протягом вказаного періоду.
    10)	Одержати список тренерів з певного виду спорту.,
    11)	Одержати список спортсменів, які протягом вказаного періоду не брали участь у жодному змаганні.
    12)	Одержати список організаторі змагань та кількість змагань, які були ними проведені протягом вказаного періоду.
    13)	Одержати перелік спортивних споруд та дати проведення на них змагань протягом певного періоду.

</h3>
</body>
</html>
